УТ_для_edt/src/InformationRegisters/смартСостоянияЗаявокНаРазборкуОборудования/смартСостоянияЗаявокНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартСостоянияЗаявокНаРазборкуОборудования</name>
  <comment>//++ #1901 смарт: Мосолов 11.07.2024 //Создание документа Заявка на разборку оборудования</comment>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.смартСостоянияЗаявокНаРазборкуОборудования</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/смартОборудованиеКРазборке/смартОборудованиеКРазборке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартОборудованиеКРазборке</name>
  <comment>#1901 смарт: Ермаков 20.08.2024 / Создание документа Заявка на разборку оборудования</comment>
  <resources>
    <name>КРазборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КРазборкеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПеремещению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПеремещениюЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КЗаказуПоставщику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КЗаказуПоставщикуЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборкеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюОборудование</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюОборудованиеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/смартСтатусыСогласованияЗаявокНаРазборкуОборудования/смартСтатусыСогласованияЗаявокНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыСогласованияЗаявокНаРазборкуОборудования</name>
  <comment>//++ #1901 смарт: Мосолов 11.07.2024 //Создание документа Заявка на разборку оборудования</comment>
  <enumValues>
    <name>НеУстановлен</name>
  </enumValues>
  <enumValues>
    <name>КСогласованию</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>НеСогласована</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартСостоянияЗаявокНаРазборкуОборудования/смартСостоянияЗаявокНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСостоянияЗаявокНаРазборкуОборудования</name>
  <comment>//++ #1901 смарт: Мосолов 11.07.2024 //Создание документа Заявка на разборку оборудования</comment>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НеСогласована</name>
  </enumValues>
  <enumValues>
    <name>ВводНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяСборка</name>
  </enumValues>
  <enumValues>
    <name>КЗаказуПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ЗаказанУПоставщика</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартНазначенияСкладов/смартНазначенияСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартНазначенияСкладов</name>
  <comment>//++ #1351 смарт: Фролов 11.05.2023 //Разделение остатков по организациям в заказах</comment>
  <enumValues>
    <name>ГарантийныеЗапчастиНеДляПродажи</name>
  </enumValues>
  <enumValues>
    <name>ДемоЗал</name>
  </enumValues>
  <enumValues>
    <name>СкладДляВнутреннихНужд</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСклад</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СтатусыВнутреннихЗаказов/СтатусыВнутреннихЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВнутреннихЗаказов</name>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОбеспечения</name>
  <enumValues>
    <name>ОтгрузитьОбособленно</name>
  </enumValues>
  <enumValues>
    <name>Отгрузить</name>
  </enumValues>
  <enumValues>
    <name>СоСклада</name>
  </enumValues>
  <enumValues>
    <name>ИзЗаказов</name>
  </enumValues>
  <enumValues>
    <name>Обособленно</name>
  </enumValues>
  <enumValues>
    <name>Требуется</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СтатусыРасходныхОрдеров/СтатусыРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРасходныхОрдеров</name>
  <enumValues>
    <name>Подготовлено</name>
  </enumValues>
  <enumValues>
    <name>КОтбору</name>
  </enumValues>
  <enumValues>
    <name>КПроверке</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеПроверки</name>
  </enumValues>
  <enumValues>
    <name>Проверен</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СкладскиеОперации/СкладскиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СкладскиеОперации</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВозвратМатериаловИзПроизводстваОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНеПринятыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>КонтрольОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ДвижениеВФинансовомУчете</name>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииВПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ОтборИзЯчеек</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВРозницу</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомплектовДляРазборки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаКомплектующихДляСборки</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаНаВнутренниеНужды</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоВозвратуПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеИзлишков</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПоПеремещениюВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукции</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеНедостач</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеПорчи</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеРезультатовПересчетов</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМеждуПомещениями</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПроизводствоОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПроизводствоПриемка</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаПродукцииИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>Пересчет</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомплектующихПослеРазборки</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратМатериаловИзПроизводстваПриемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоВозвратуОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПеремещению</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПрочемуОприходованию</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПоПеремещениюВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаПродукцииИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаСобранныхКомплектов</name>
  </enumValues>
  <enumValues>
    <name>РазмещениеВЯчейки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНеПринятыхТоваровУстарел</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеМатериаловПриПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловНаЗатраты</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаПродукцииДляГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеСЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ВзаимодействиеСВЕТИС</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииНоменклатуры</name>
  <attributes>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>DefinedType.НомерСерии</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>DefinedType.НомерКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>EPCGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDМеткаНеЧитаемая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Справка2ЕГАИС</name>
    <type>
      <types>CatalogRef.Справки2ЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительВЕТИС</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьСкладскогоЖурналаВЕТИС</name>
    <type>
      <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПартииВЕТИС</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяРозничнаяЦенаМОТП</name>
    <comment>Максимальная розничная цена (МОТП)</comment>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусПроверкиОборудования</name>
    <comment>++ #1250 Фролов 17.11.2022 //Проверенное оборудование. &quot;Запрет на отгрузку без проверки оборудования  #1143 &quot;</comment>
    <type>
      <types>EnumRef.смартСтатусыПроверкиОборудованияПоСерии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартДанныеУпаковочногоЛиста</name>
    <comment>//++ #Б1140 смарт: Шляпников 02.09.2025 / Учет данных по упаковочным листам.</comment>
    <attributes>
      <name>ТипУпаковки</name>
      <type>
        <types>EnumRef.смартТипыУпаковокУпаковочногоЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Хрупкое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/смартСостоянияЗаявокНаРазборкуОборудования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Процедура по переданной ссылке на заявку расчитывает и записывает в регистр сведений ее состояние.
//
//	Параметры:
//		Заявка - ДокументСсылка, в рамках проведения которого перерасчитывается состояние
//		Отказ - Булево - признак прерывания обработки проведения
//		УдалениеПроведения - Булево - признак обработки удаления проведения.
//
Процедура ОтразитьСостояниеЗаявки(Знач Заявка, Отказ, УдалениеПроведения = Ложь, ДокументДвижения = Неопределено) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(Заявка) = Тип("ДокументСсылка.смартЗаявкаНаРазборкуОборудования") Тогда
		
		МассивЗаявок = Документы.смартЗаявкаНаРазборкуОборудования.ПолучитьСсылкуНаЗаявкуПоОснованию(Заявка, Истина);
		
		Если МассивЗаявок.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
	Иначе
		МассивЗаявок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Заявка);
	КонецЕсли;
	
	СтатусыСогласованияМенеджер = Перечисления.смартСтатусыСогласованияЗаявокНаРазборкуОборудования; 
	СостоянияЗаявокМенеджер = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования;
	
	МассивУведомлений = Новый Массив;
	
	Для каждого Заявка Из МассивЗаявок Цикл
		
		ТекущееСостояние = ПолучитьСостояниеЗаявки(Заявка);
		НовоеСостояниеЗаявки = СостоянияЗаявокМенеджер.Подготовка;
		
		Если Заявка.СтатусСогласования = СтатусыСогласованияМенеджер.НеСогласована Тогда

			НовоеСостояниеЗаявки = СостоянияЗаявокМенеджер.НеСогласована;
			
			Если НЕ ТекущееСостояние = НовоеСостояниеЗаявки Тогда
				
				ПолучателиСообщения = Заявка.Ответственный;
				
				АдресаПолучателей = смартОбщегоНазначения.ПолучитьАдресаПользователей(ПолучателиСообщения);
				Тема = СтрШаблон("Заявка на разборку оборудования № %1 от %2", Заявка.Номер, Формат(Заявка.Дата,"ДФ=dd.MM.yyyy"));
				ТекстПисьма = СтрШаблон("Добрый день.
				                        |
										|Ваша заявка отклонена по причине : %1.
										|Ссылка на документ : %2.
				                        |
										|Данное сообщение сформировано автоматически. Отвечать на него не нужно.", Заявка.ПричинаНесогласования, ПолучитьНавигационнуюСсылку(Заявка));
				
				МассивУведомлений.Добавить(Новый Структура("АдресаПолучателей,Тема,ТекстПисьма,Объект,ВидСобытия", 
															АдресаПолучателей,
															Тема,
															ТекстПисьма,
															Заявка,
															"СогласованиеОтклонено"));
				
			КонецЕсли;
			
		ИначеЕсли Заявка.Отменена Тогда
			НовоеСостояниеЗаявки = СостоянияЗаявокМенеджер.Отменена;
		ИначеЕсли Заявка.СтатусСогласования = СтатусыСогласованияМенеджер.КСогласованию Тогда
			
			НовоеСостояниеЗаявки = СостоянияЗаявокМенеджер.НаСогласовании;
			
			Если НЕ ТекущееСостояние = НовоеСостояниеЗаявки Тогда
				
				ПолучателиСообщения = Новый Массив;
				МОЛ = Неопределено;
				
				Если ЗначениеЗаполнено(Заявка.ПереместитьСоСклада) Тогда
					СкладКонтроля = Заявка.ПереместитьСоСклада;
				Иначе
					СкладКонтроля = Заявка.Склад;
				КонецЕсли;
				
				Если СкладКонтроля.смартНазначениеСклада = Перечисления.смартНазначенияСкладов.ТорговыйСклад Тогда
					
					Если СокрЛП(СкладКонтроля.БизнесРегион) = "Москва" ИЛИ СокрЛП(СкладКонтроля.БизнесРегион) = "Москва (регион)" Тогда
						ПолучателиСообщения.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Ларьков Александр Сергеевич"));
						ПолучателиСообщения.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Белова Татьяна Анатольевна"));
					Иначе
						МОЛ = СкладКонтроля.ТекущийОтветственный;
					КонецЕсли;
					
				ИначеЕсли СкладКонтроля.смартНазначениеСклада = Перечисления.смартНазначенияСкладов.ДемоЗал Тогда
					МОЛ = СкладКонтроля.ТекущийОтветственный;
				ИначеЕсли СкладКонтроля.смартНазначениеСклада = Перечисления.смартНазначенияСкладов.СкладДляВнутреннихНужд Тогда
					ПолучателиСообщения.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Белова Татьяна Анатольевна"));
				Иначе
					ПолучателиСообщения.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Ларьков Александр Сергеевич"));
				КонецЕсли;
				
				АдресаПолучателей = смартОбщегоНазначения.ПолучитьАдресаПользователей(ПолучателиСообщения);
				АдресМОЛ = ПолучитьАдресФизическогоЛицаДляОтправкиПочтовыхУведомлений(МОЛ);
				Если ЗначениеЗаполнено(АдресМОЛ) Тогда
					АдресаПолучателей.Добавить(АдресМОЛ);
				КонецЕсли;
				
				Тема = СтрШаблон("СРОЧНО! Необходимо согласовать Заявку на разборку оборудования № %1 от %2", Заявка.Номер, Формат(Заявка.Дата,"ДФ=dd.MM.yyyy"));
				ТекстПисьма = СтрШаблон("Добрый день.
				                        |
										|Необходимо согласовать Заявку на разборку оборудования № %1 от %2.
										|Оборудование %3 %4
										|Причина разборки: %5 
										//++ #7770 смарт: Тимофеева 05.08.2026 / Поправить текст в оповещении: Необходимо согласовать Заявку на разборку оборудования
										//|Ссылка на документ : %6.
										|Ссылка на документ : %6 
										//-- #7770 смарт: Тимофеева 05.08.2026
				                        |
										|Данное сообщение сформировано автоматически. Отвечать на него не нужно.", 
				 						Заявка.Номер,
										Формат(Заявка.Дата,"ДФ=dd.MM.yyyy"),
										Заявка.Номенклатура,
										Заявка.Серия,
										Заявка.ПричинаРазборки, 
										ПолучитьНавигационнуюСсылку(Заявка));
										
				МассивУведомлений.Добавить(Новый Структура("АдресаПолучателей,Тема,ТекстПисьма,Объект,ВидСобытия", 
															АдресаПолучателей,
															Тема,
															ТекстПисьма,
															Заявка,
															"ЗаявкаПоступилаНаСогласование"));
				
			КонецЕсли;
			
		ИначеЕсли Заявка.СтатусСогласования = СтатусыСогласованияМенеджер.Согласована И НЕ Заявка.КВыполнению Тогда
			
			НовоеСостояниеЗаявки = СостоянияЗаявокМенеджер.ВводНоменклатуры;
			
			Если НЕ ТекущееСостояние = НовоеСостояниеЗаявки Тогда
				
				ПолучателиСообщения = Заявка.Ответственный;
				
				АдресаПолучателей = смартОбщегоНазначения.ПолучитьАдресаПользователей(ПолучателиСообщения);
				Тема = СтрШаблон("Заявка на разборку оборудования № %1 от %2", Заявка.Номер, Формат(Заявка.Дата,"ДФ=dd.MM.yyyy"));
				ТекстПисьма = СтрШаблон("Добрый день.
				                        |
										|Ваша заявка согласована.
										|Ссылка на документ : %2.
				                        |
										|Данное сообщение сформировано автоматически. Отвечать на него не нужно.", Заявка.ПричинаНесогласования, ПолучитьНавигационнуюСсылку(Заявка));
				
				МассивУведомлений.Добавить(Новый Структура("АдресаПолучателей,Тема,ТекстПисьма,Объект,ВидСобытия", 
															АдресаПолучателей,
															Тема,
															ТекстПисьма,
															Заявка,
															"ЗаявкаСогласована"));
				
			КонецЕсли;
			
		ИначеЕсли Заявка.КВыполнению Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Заявка", Заявка);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Заявка КАК Заявка,
			|	КРазборкеОстаток КАК КРазборке,
			|	КРазборкеЗаказаноОстаток КАК КРазборкеЗаказано,
			|	КПолучениюОстаток КАК КПолучению,
			|	КПолучениюЗаказаноОстаток КАК КПолучениюЗаказано,
			|	КПеремещениюОстаток КАК КПеремещению,
			|	КПеремещениюЗаказаноОстаток КАК КПеремещениюЗаказано,
			|	КЗаказуПоставщикуОстаток КАК КЗаказуПоставщику,
			|	КЗаказуПоставщикуЗаказаноОстаток КАК КЗаказуПоставщикуЗаказано,
			|	КСборкеОстаток КАК КСборке,
			|	КСборкеЗаказаноОстаток КАК КСборкеЗаказано,
			|	КПолучениюОборудованиеОстаток КАК КПолучениюОборудование,
			|	КПолучениюОборудованиеЗаказаноОстаток КАК КПолучениюОборудованиеЗаказано
			|ИЗ
			|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(, Заявка = &Заявка)";
			Результат = Запрос.Выполнить();
			
			// Если по регистру нет остатков - заявка выполнена
			НовоеСостояниеЗаявки = 
				?(Результат.Пустой(),
					СостоянияЗаявокМенеджер.Выполнена,
					СостоянияЗаявокМенеджер.ВРаботе);
					
			Если НовоеСостояниеЗаявки = СостоянияЗаявокМенеджер.ВРаботе Тогда
				
				Остатки = Результат.Выгрузить()[0];
				
				Если Остатки.КЗаказуПоставщику <> 0 И Остатки.КЗаказуПоставщикуЗаказано = Остатки.КЗаказуПоставщику Тогда
					НовоеСостояниеЗаявки = СостоянияЗаявокМенеджер.ЗаказанУПоставщика;
				ИначеЕсли Остатки.КЗаказуПоставщику <> 0 Тогда
					
					НовоеСостояниеЗаявки = СостоянияЗаявокМенеджер.КЗаказуПоставщику;
					
					Если НЕ ТекущееСостояние = НовоеСостояниеЗаявки Тогда
						
						Уведомление = смартУведомления.ПолучитьИнформациюОПоследнемУведомлении(Заявка, "КЗаказуПоставщику");
						
						Если НЕ ЗначениеЗаполнено(Уведомление.ДатаУведомления) Тогда
						
							//пока так, потом переделаем на универсальный механизм, как появится
							ПолучателиСообщения = Справочники.Пользователи.НайтиПоНаименованию("Жариков Евгений Владимирович");
							
							АдресаПолучателей = смартОбщегоНазначения.ПолучитьАдресаПользователей(ПолучателиСообщения);
							Тема = "Требуется оформить предзаказ поставщику.";
							ТекстПисьма = СтрШаблон("Добрый день.
													|
													|По Заявке на разборку оборудования № %1 от %2 необходимо заказать:
													|%3
													|
													|Данное сообщение сформировано автоматически. Отвечать на него не нужно.", 
													Заявка.Номер, Формат(Заявка.Дата,"ДФ=dd.MM.yyyy"), СформироватьТекстТоварыКЗаказу(Заявка));
													
							МассивУведомлений.Добавить(Новый Структура("АдресаПолучателей,Тема,ТекстПисьма,Объект,ВидСобытия", 
																АдресаПолучателей,
																Тема,
																ТекстПисьма,
																Заявка,
																"КЗаказуПоставщику"));
																
						КонецЕсли;
						
					КонецЕсли;
					
				ИначеЕсли Остатки.КСборке <> 0 Тогда
					НовоеСостояниеЗаявки = СостоянияЗаявокМенеджер.ОжидаетсяСборка;
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Заявка = Заявка;
		МенеджерЗаписи.Состояние = НовоеСостояниеЗаявки;
		МенеджерЗаписи.Записать(Истина);
		
		Если НовоеСостояниеЗаявки = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.ВРаботе
			 ИЛИ НовоеСостояниеЗаявки = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.КЗаказуПоставщику
			 ИЛИ НовоеСостояниеЗаявки = Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.ОжидаетсяСборка Тогда
			СформироватьДокументы(Заявка, УдалениеПроведения, ДокументДвижения);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Уведомление Из МассивУведомлений Цикл
		смартУведомления.ОтправитьПочтовоеУведомление(Уведомление.Объект, Уведомление.ВидСобытия, Уведомление.Тема, Уведомление.ТекстПисьма, Уведомление.АдресаПолучателей);
	КонецЦикла;
	
КонецПроцедуры		

// Функция по переданной ссылке на заявку получает ее текущее состояние.
//
//	Параметры:
//		Заявка - ДокументСсылка - документ, по которым надо получить состояние.
//	Возвращаемое значение:
//		Состояние - ПеречислениеСсылка.смартСостоянияЗаявокНаРазборкуОборудования
//			Если Заявка является пустой ссылкой, возвращается значение "Подготовка"
//
Функция ПолучитьСостояниеЗаявки(Заявка) Экспорт

	Если Заявка.Пустая() Тогда
		Возврат Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.Подготовка;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заявка = Заявка;
	МенеджерЗаписи.Прочитать();
		
	Возврат ?(МенеджерЗаписи.Выбран(), 
				МенеджерЗаписи.Состояние, 
				Перечисления.смартСостоянияЗаявокНаРазборкуОборудования.Подготовка);
	
КонецФункции

// Процедура формирует необходимые документы, которые требуются на текущем состоянии.
// Параметры:
//		Заявка - ДокументСсылка.смартЗаявкаНаРазборкуОборудования
//		УдалениеПроведения - Булево - признак обработки удаления проведения.
//
Процедура СформироватьДокументы(Заявка, УдалениеПроведения, ДокументДвижения)
	
	Если УдалениеПроведения Тогда
		Возврат;
	КонецЕсли;

	АвтоматическиФормироватьДокументы = Ложь;
	
	Если смартОбщегоНазначенияСКэш.ПроверитьСкладРазбораНаДоступностьАвтоматическогоФормированияДокументов(Заявка.Склад) Тогда
		
		Если (НЕ ЗначениеЗаполнено(Заявка.ПереместитьСоСклада) ИЛИ Заявка.ПереместитьСоСклада = Заявка.Склад)
			И НЕ ЗначениеЗаполнено(Заявка.УзелПереместитьНаСклад) Тогда
			
			АвтоматическиФормироватьДокументы = Истина;
			Для каждого стрКомплектующие Из Заявка.Комплектующие Цикл
				
				Если НЕ стрКомплектующие.ПереместитьНаСклад.смартНазначениеСклада = Перечисления.смартНазначенияСкладов.ФизическоеЛицо Тогда
					АвтоматическиФормироватьДокументы = Ложь;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивАвтоматическиСформированныхДокументов = Новый Массив;
	ОтправлятьУведомлениеПоАвтоматическиСформированнымДокументам = Ложь;
	
	ТекстЗапросаЗаказНаПеремещение =                                           
	"// Заказываем перемещение оборудования на склад ремонта
	|ВЫБРАТЬ
	|	&ТекущаяДата КАК Дата, 
	|	&ТекущаяДата КАК НачалоОтгрузки, 
	|	&ТекущаяДата КАК ОкончаниеПоступления,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению) КАК Статус,
	|	Заявка КАК ДокументОснование,
	|	Номенклатура, 
	|	Серия,
	|	Назначение,
	|	Склад КАК СкладОтправитель, 
	|	СкладПолучатель КАК СкладПолучатель,
	|	КПеремещениюОстаток - КПеремещениюЗаказаноОстаток КАК Количество, 
	|	КПеремещениюОстаток - КПеремещениюЗаказаноОстаток КАК КоличествоУпаковок,
	|	&ВариантОбеспечения КАК ВариантОбеспечения,
	|	14 КАК СтатусУказанияСерий
	|ИЗ
	|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(
	|		, 
	|		Заявка = &Заявка
	|			И СкладПолучатель = Заявка.Склад
	|	)
	|ГДЕ
	|	КПеремещениюОстаток - КПеремещениюЗаказаноОстаток > 0
	|";
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапросаЗаказНаПеремещение;
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Если ЗначениеЗаполнено(Заявка.Назначение) Тогда
		Запрос.УстановитьПараметр("ВариантОбеспечения", Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно);
	Иначе
		Запрос.УстановитьПараметр("ВариантОбеспечения", Перечисления.ВариантыОбеспечения.Отгрузить);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НоменклатураВидНоменклатурыТоварПлоттерыСерии", 
		Справочники.смартПредопределенныеЗначения.Настройки.НоменклатураВидНоменклатурыТоварПлоттерыСерии);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	//0. заказ на перемещение оборудования разбора со склада на склад разбора
	
	Если Выборка.Следующий() Тогда
		
		
		СтруктураЗаполнения = 
			Новый Структура("Организация, Подразделение, ДокументОснование, Дата, Статус, 
							|СкладОтправитель, СкладПолучатель, Товары");
			
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Заявка, "Организация, Подразделение");
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);

		СтруктураЗаполнения.Товары = Запрос.Выполнить().Выгрузить();
		
		ДокументЗаказ = Документы.ЗаказНаПеремещение.СоздатьДокумент();
		ДокументЗаказ.Заполнить(СтруктураЗаполнения);
		ДокументЗаказ.Ответственный = Заявка.Ответственный;
		ДокументЗаказ.Комментарий = "#Документ создан автоматически#";
		ДокументЗаказ.ДополнительныеСвойства.Вставить("НеОтражатьСостояниеЗаявкиНаРазборОборудования", Истина);
		ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
	КонецЕсли;
	
	// Проверка на завершение предыдущей операции
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заявка, КПеремещениюОстаток
	|ИЗ
	|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(
	|		,
	|		Заявка = &Заявка
	|			И СкладПолучатель = Заявка.Склад
	|	)
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ТекущаяДата КАК Дата,
	|	&ТекущаяДата КАК НачалоСборкиРазборки, 
	|	&ТекущаяДата КАК ОкончаниеСборкиРазборки,	
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению) КАК Статус,
	|	Заявка КАК ДокументОснование,
	|	Номенклатура, 
	|	Серия, 
	|	Склад, 
	|	Назначение,
	|	КРазборкеОстаток - КРазборкеЗаказаноОстаток КАК Количество, 
	|	КРазборкеОстаток - КРазборкеЗаказаноОстаток КАК КоличествоУпаковок, 
	|	&ВариантОбеспечения КАК ВариантОбеспечения,
	|	14 КАК СтатусУказанияСерий,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров) КАК ХозяйственнаяОперация 
	|ИЗ
	|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(
	|		,
	|		Заявка = &Заявка
	|	)
	|ГДЕ
	|	КРазборкеОстаток - КРазборкеЗаказаноОстаток > 0
	|				
	|; 
	|////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	КПолучениюОстаток - КПолучениюЗаказаноОстаток КАК Количество,
	|	КПолучениюОстаток - КПолучениюЗаказаноОстаток КАК КоличествоУпаковок,
	|	&ВариантОбеспечения КАК ВариантОбеспечения,
	|	ВЫБОР
	|		КОГДА Номенклатура.ВидНоменклатуры = &НоменклатураВидНоменклатурыТоварПлоттерыСерии 
	|		ТОГДА 14
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусУказанияСерий,
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	|	ВЫБОР 
	|		КОГДА Номенклатура = Заявка.Узел ТОГДА
	|			Заявка.НазначениеПолученныйУзел
	|		ИНАЧЕ
	|			Заявка.НазначениеСнятаяЗапаснаяЧасть
	|	КОНЕЦ КАК Назначение
	//-- #Б2138 смарт: Шляпников 19.02.2025
	|ИЗ
	|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(
	|		,
	|		Заявка = &Заявка
	|	)
	|ГДЕ
	|	КПолучениюОстаток - КПолучениюЗаказаноОстаток > 0
	|";
	
	//1. Заказ на разборку
	//	+ Разборка - если выполняется условия автоматического формирования
	//	+ Расходный ордер - если выполняется условия автоматического формирования
	//	+ Приходный ордер - если выполняется условия автоматического формирования
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	Выборка = ПакетРезультатовЗапроса[0].Выбрать();
	СозданЗаказНаСборку = Ложь;
	
	Если Выборка.Следующий() Тогда
	
		СтруктураЗаполнения = 
			Новый Структура("Организация, Количество, КоличествоУпаковок, Подразделение, ДокументОснование, Дата, Статус, Склад,
							|Номенклатура, Серия, ХозяйственнаяОперация, 
							|НачалоСборкиРазборки, ОкончаниеСборкиРазборки, Товары");
		
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Заявка, "Организация, Подразделение");
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);
		
		СтруктураЗаполнения.Товары = ПакетРезультатовЗапроса[1].Выгрузить();
		
		Документ = Документы.ЗаказНаСборку.СоздатьДокумент();
		Документ.Заполнить(СтруктураЗаполнения);
		Документ.Дата = ТекущаяДатаСеанса();
		
		Если ЗначениеЗаполнено(Заявка.Назначение) Тогда
			Документ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно;
			Документ.Назначение = Заявка.Назначение;
		Иначе
			Документ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		КонецЕсли;
		
		Документ.СтатусУказанияСерий = 14;
		
		Для Каждого СтрокаТовары Из Документ.Товары Цикл
			СтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно;
		КонецЦикла;
		
		Документ.Комментарий = "#Документ создан автоматически#";
		Документ.ДополнительныеСвойства.Вставить("НеОтражатьСостояниеЗаявкиНаРазборОборудования", Истина);
		Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
		СозданЗаказНаСборку = Истина;
		
	КонецЕсли;
	
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// Формируем сборку автоматически
	//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	
	Если АвтоматическиФормироватьДокументы И СозданЗаказНаСборку ИЛИ ТипЗнч(ДокументДвижения) = Тип("ДокументСсылка.ЗаказНаСборку") ИЛИ ТипЗнч(ДокументДвижения) = Тип("ДокументСсылка.СборкаТоваров") Тогда
		
		ТребуетсяФормироватьСборку = Ложь;
		
		Если ТипЗнч(ДокументДвижения) = Тип("ДокументСсылка.ЗаказНаСборку") Тогда
			
			ДокументЗаказ = ДокументДвижения;
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Заявка, КРазборкеОстаток, КПолучениюОстаток
			|ИЗ
			|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(
			|		,
			|		Заявка = &Заявка
			|	)
			|";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТребуетсяФормироватьСборку = Истина;
			КонецЕсли;
			
		ИначеЕсли СозданЗаказНаСборку Тогда
			
			ДокументЗаказ = Документ.Ссылка;
			ТребуетсяФормироватьСборку = Истина;
			
		Иначе
			ДокументЗаказ = ДокументДвижения.ЗаказНаСборку;
		КонецЕсли;
		
		//1. сборка
		Если ТребуетсяФормироватьСборку Тогда
			
			МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументЗаказ);
			ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивСсылок,
																													"СборкаТоваров");
			Разборка = Документы.СборкаТоваров.СоздатьДокумент();
			Разборка.Заполнить(ПараметрыОткрытия.ПараметрыФормы.Основание);
			Разборка.Дата = ДокументЗаказ.Дата + 5;
			
			Для каждого стрТовары Из Разборка.Товары Цикл
				
				Если стрТовары.Номенклатура = Заявка.Узел Тогда
					
					стрТовары.ДоляСтоимости = 100 - Заявка.Комплектующие.Итог("ДоляСтоимости");
					стрТовары.Серия = Разборка.Серия;
					Если ЗначениеЗаполнено(стрТовары.Серия) Тогда
						стрТовары.СтатусУказанияСерий = 14;
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;
				
				НайденныеСтроки = Заявка.Комплектующие.НайтиСтроки(Новый Структура("Номенклатура", стрТовары.Номенклатура));
				Если НайденныеСтроки.Количество() > 0 Тогда
					стрТовары.ДоляСтоимости = НайденныеСтроки[0].ДоляСтоимости;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(Заявка.Серия) Тогда
				
				Разборка.СтатусУказанияСерий = 14;
				Разборка.Серия = Заявка.Серия;
				
			КонецЕсли;
			
			Разборка.Комментарий = "#Документ создан автоматически#";
			Разборка.ДополнительныеСвойства.Вставить("НеОтражатьСостояниеЗаявкиНаРазборОборудования", Истина);
			Разборка.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
			МассивАвтоматическиСформированныхДокументов.Добавить(Разборка.Ссылка);
			
		КонецЕсли;
		
		Если АвтоматическиФормироватьДокументы Тогда
			
			//2. расходный ордер
			Если (ДокументЗаказ.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке И ДокументЗаказ.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке < ДокументЗаказ.Дата) Тогда
				
				Если НЕ ПроверитьНаличиеОрдера(ДокументЗаказ, 2) Тогда
					РасходныйОрдер = СоздатьРасходныйОрдер(ДокументЗаказ, ТекущаяДатаСеанса() + 10);
					ОтправлятьУведомлениеПоАвтоматическиСформированнымДокументам = Истина;
					МассивАвтоматическиСформированныхДокументов.Добавить(РасходныйОрдер);
				КонецЕсли;
				
			КонецЕсли;
			
			//3. приходный ордер
			Если (ДокументЗаказ.Склад.ИспользоватьОрдернуюСхемуПриПоступлении И ДокументЗаказ.Склад.ДатаНачалаОрдернойСхемыПриПоступлении < ДокументЗаказ.Дата) Тогда
				
				Если НЕ ПроверитьНаличиеОрдера(ДокументЗаказ, 1) Тогда
					ПриходныйОрдер = СоздатьПриходныйОрдер(ДокументЗаказ, ТекущаяДатаСеанса() + 15);
					ОтправлятьУведомлениеПоАвтоматическиСформированнымДокументам = Истина;
					МассивАвтоматическиСформированныхДокументов.Добавить(ПриходныйОрдер);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка на завершение предыдущей операции
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заявка, КРазборкеОстаток, КПолучениюОстаток
	|ИЗ
	|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(
	|		,
	|		Заявка = &Заявка
	|	)
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаЗаказНаПеремещение = 
		СтрЗаменить(
			ТекстЗапросаЗаказНаПеремещение, 
			"	Серия,",
			"	ВЫБОР
			|		КОГДА Номенклатура.ВидНоменклатуры = &НоменклатураВидНоменклатурыТоварПлоттерыСерии 
			|		ТОГДА Серия
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
			|	КОНЕЦ КАК Серия,");	
	
	ТекстЗапросаЗаказНаПеремещение = 
		СтрЗаменить(
			ТекстЗапросаЗаказНаПеремещение, 
			"	14 КАК СтатусУказанияСерий",
			"	ВЫБОР
			|		КОГДА Номенклатура.ВидНоменклатуры = &НоменклатураВидНоменклатурыТоварПлоттерыСерии 
			|		ТОГДА 14
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СтатусУказанияСерий");		
		
	ТекстЗапросаЗаказНаПеремещение = 
		СтрЗаменить(
			ТекстЗапросаЗаказНаПеремещение,
			"СкладПолучатель = Заявка.Склад",
			"Склад = Заявка.Склад" );
		
    ТекстЗапросаЗаказНаПеремещение = 
		ТекстЗапросаЗаказНаПеремещение + "
		|ИТОГИ ПО СкладПолучатель";
			
	Запрос.Текст = ТекстЗапросаЗаказНаПеремещение;
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//2. Заказ на перемещение разобранных запчастей 
	//	+ Перемещение разобранных запчастей - если выполняется условие
	//	+ Расходный ордер - если выполняется условие
	
	Пока Выборка.Следующий() Цикл
		
		//1. Заказ на перемещение
		СтруктураЗаполнения = 
			Новый Структура("Организация, Подразделение, ДокументОснование, Дата, Статус, 
							|СкладОтправитель, СкладПолучатель, Товары");
			
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Заявка, "Организация, Подразделение");
		
		ДокументЗаказ = Документы.ЗаказНаПеремещение.СоздатьДокумент();
		СтруктураЗаполнения.Товары = ДокументЗаказ.Товары.Выгрузить();
		
		ВыборкаТоваров = Выборка.Выбрать();
		ВыборкаТоваров.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, ВыборкаТоваров);
		
		Если (НЕ СтруктураЗаполнения.СкладОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке ИЛИ СтруктураЗаполнения.СкладОтправитель.ДатаНачалаОрдернойСхемыПриОтгрузке > СтруктураЗаполнения.Дата)
			И (НЕ СтруктураЗаполнения.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении ИЛИ СтруктураЗаполнения.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении > СтруктураЗаполнения.Дата) Тогда
			ОтгрузкаДоступна = Истина;
		Иначе
			ОтгрузкаДоступна = Ложь;
		КонецЕсли;
		
		ВыборкаТоваров.Сбросить();
		
		Пока ВыборкаТоваров.Следующий() Цикл
			
			НоваяСтрокаТовары = СтруктураЗаполнения.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары, ВыборкаТоваров);
			
			//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
			Если ОтгрузкаДоступна ИЛИ АвтоматическиФормироватьДокументы Тогда
				НоваяСтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно;
			Иначе
				НоваяСтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно;
			КонецЕсли;
			
			Если НоваяСтрокаТовары.Номенклатура = Заявка.Узел Тогда
				НоваяСтрокаТовары.Назначение = Заявка.НазначениеПолученныйУзел;
			Иначе
				НоваяСтрокаТовары.Назначение = Заявка.НазначениеСнятаяЗапаснаяЧасть;
			КонецЕсли;
			//-- #Б2138 смарт: Шляпников 19.02.2025
			
		КонецЦикла;
		
		ДокументЗаказ.Заполнить(СтруктураЗаполнения);
		ДокументЗаказ.Дата = ТекущаяДатаСеанса() + 20;
		ДокументЗаказ.Ответственный = Заявка.Ответственный;
		
		ДокументЗаказ.Комментарий = "#Документ создан автоматически#";
		ДокументЗаказ.ДополнительныеСвойства.Вставить("НеОтражатьСостояниеЗаявкиНаРазборОборудования", Истина);
		ДокументЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
		//2. Перемещение товаров
		Если ОтгрузкаДоступна ИЛИ АвтоматическиФормироватьДокументы Тогда
			
			ДокументПеремещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
		
			МассивЗаказов = Новый Массив;
			МассивЗаказов.Добавить(ДокументЗаказ.Ссылка);

			ДанныеЗаполнения = Новый Структура;
			ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивЗаказов, "ПеремещениеТоваров");
			ДанныеЗаполнения = ПараметрыОткрытия.ПараметрыФормы.Основание;
			
			ДокументПеремещение.Заполнить(ДанныеЗаполнения);
			
			ДокументПеремещение.Дата = ДокументЗаказ.Дата + 5;
			ДокументПеремещение.Комментарий = ДокументЗаказ.Комментарий;
			ДокументПеремещение.смартЗапчастиГарантийные = ДокументЗаказ.смартЗапчастиГарантийные;
			
			ДокументПеремещение.Комментарий = "#Документ создан автоматически#";
			ДокументПеремещение.ДополнительныеСвойства.Вставить("НеОтражатьСостояниеЗаявкиНаРазборОборудования", Истина);
			ДокументПеремещение.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
			МассивАвтоматическиСформированныхДокументов.Добавить(ДокументПеремещение.Ссылка);
			
		КонецЕсли;
		
		//3. Расходный ордер
		Если АвтоматическиФормироватьДокументы Тогда
			Если (ДокументЗаказ.СкладОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке И ДокументЗаказ.СкладОтправитель.ДатаНачалаОрдернойСхемыПриОтгрузке < ДокументЗаказ.Дата) Тогда
			
				РасходныйОрдер = СоздатьРасходныйОрдер(ДокументЗаказ.Ссылка, ДокументЗаказ.Дата + 10);
				ОтправлятьУведомлениеПоАвтоматическиСформированнымДокументам = Истина;
				МассивАвтоматическиСформированныхДокументов.Добавить(РасходныйОрдер);
				
			КонецЕсли;
		КонецЕсли;
		
		//4. Приходный ордер
		Если АвтоматическиФормироватьДокументы Тогда
			Если (ДокументЗаказ.СкладПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении И ДокументЗаказ.СкладПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении < ДокументЗаказ.Дата) Тогда
				
				//++ #5806 смарт: Тимофеева 26.02.26 / Перевод запчастей на серийный учет. Автоматизация создания ордеров для складов физлиц.
				//ПриходныйОрдер = СоздатьРасходныйОрдер(ДокументЗаказ.Ссылка, ДокументЗаказ.Дата + 15);
				ПриходныйОрдер = СоздатьПриходныйОрдер(ДокументЗаказ.Ссылка, ДокументЗаказ.Дата + 15);
				//-- #5806 смарт: Тимофеева 26.02.26 / Перевод запчастей на серийный учет. Автоматизация создания ордеров для складов физлиц.
				ОтправлятьУведомлениеПоАвтоматическиСформированнымДокументам = Истина;
				МассивАвтоматическиСформированныхДокументов.Добавить(ПриходныйОрдер);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтправлятьУведомлениеПоАвтоматическиСформированнымДокументам Тогда
		
		ВидУведомления = "УведомлениеОбАвтоматическиСозданныхДокументахВЗаявкеНаРазборку";
		Тема = СтрШаблон("Заявка на разборку оборудования %1 от %2", Заявка.Номер, Формат(Заявка.Дата, "ДФ=dd.MM.yyyy"));
		
		СписокДокументовСтрокой = "";
		Для н = 1 По МассивАвтоматическиСформированныхДокументов.Количество() Цикл
			СтрокаДокумента = СтрШаблон("%1.%2", н, СокрЛП(МассивАвтоматическиСформированныхДокументов[н - 1]));
			СписокДокументовСтрокой = СтрШаблон("%1%2%3", СписокДокументовСтрокой, СтрокаДокумента, Символы.ПС);
		КонецЦикла;
		
		Тело = СтрШаблон("Добрый день!  
                         |
						 |По документу *Заявка на разборку оборудования %1 от %2* по оборудованию *%3 %4* автоматически созданы следующие документы (%5):  
						 |%6
						 |Письмо сформировано автоматически и не требует ответа.", 
						 Заявка.Номер, 
						 Формат(Заявка.Дата, "ДФ=dd.MM.yyyy"), 
						 Заявка.Номенклатура, 
						 Заявка.Серия,
						 Заявка.Склад,
						 СписокДокументовСтрокой);
						 
		АдресПолучателей = Новый Массив;
		АдресаВКопии = Новый Массив;
		АдресаВСкрытойКопии = Новый Массив;
		
		Если Заявка.Склад.Родитель = Справочники.смартПредопределенныеЗначения.СкладМоскваОфис.Значение Тогда
			
			НастройкиУведомления = смартУведомления.ПолучитьНастройкиОбработкиВыполненияПоИдентификатору(ВидУведомления);
			Если ТипЗнч(НастройкиУведомления) = Тип("Структура") И НастройкиУведомления.Свойство("ПолучателиУведомлений") Тогда
				Если НастройкиУведомления.ПолучателиУведомлений <> Неопределено Тогда
					
					МассивПолучателей = НастройкиУведомления.ПолучателиУведомлений.Скопировать(Новый Структура("Получатель", Истина), "Пользователь").ВыгрузитьКолонку("Пользователь");
					АдресаПолучателей = смартУведомления.СформироватьАдресаПолучателейДляОтправки(МассивПолучателей);
					
					МассивПолучателей = НастройкиУведомления.ПолучателиУведомлений.Скопировать(Новый Структура("ВКопии", Истина), "Пользователь").ВыгрузитьКолонку("Пользователь");
					АдресаВКопии = смартУведомления.СформироватьАдресаПолучателейДляОтправки(МассивПолучателей);
					
					МассивПолучателей = НастройкиУведомления.ПолучателиУведомлений.Скопировать(Новый Структура("ВСкрытойКопии", Истина), "Пользователь").ВыгрузитьКолонку("Пользователь");
					АдресаВСкрытойКопии = смартУведомления.СформироватьАдресаПолучателейДляОтправки(МассивПолучателей);
					
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			МОЛ = Заявка.Склад.ТекущийОтветственный;
			Если ЗначениеЗаполнено(МОЛ) Тогда
				АдресаПолучателей = смартУведомления.СформироватьАдресаПолучателейДляОтправки(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МОЛ));
			КонецЕсли;
			
		КонецЕсли;
				
		Если АдресаПолучателей.Количество() > 0 Тогда
			смартУведомления.ОтправитьПочтовоеУведомление(Заявка, ВидУведомления, Тема, Тело, АдресаПолучателей, АдресаВКопии, АдресаВСкрытойКопии,,,,,, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	// Проверка на завершение предыдущей операции
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заявка, КРазборкеОстаток
	|ИЗ
	|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(
	|		,
	|		Заявка = &Заявка
	|			И СкладПолучатель = Заявка.Склад
	|	)
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ТекущаяДата КАК Дата,
	|	&ТекущаяДата КАК НачалоСборкиРазборки, 
	|	&ТекущаяДата КАК ОкончаниеСборкиРазборки,	
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению) КАК Статус,
	|	Заявка КАК ДокументОснование,
	|	Номенклатура, 
	|	Серия, 
	|	Склад, 
	|	КПолучениюОборудованиеОстаток - КПолучениюОборудованиеЗаказаноОстаток КАК Количество, 
	|	КПолучениюОборудованиеОстаток - КПолучениюОборудованиеЗаказаноОстаток КАК КоличествоУпаковок, 
	|	&ВариантОбеспечения КАК ВариантОбеспечения,
	|	14 КАК СтатусУказанияСерий,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров) КАК ХозяйственнаяОперация 
	|ИЗ
	|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(
	|		,
	|		Заявка = &Заявка
	|	)
	|ГДЕ
	|	КПолучениюОборудованиеОстаток - КПолучениюОборудованиеЗаказаноОстаток > 0
	|				
	|; 
	|////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	КСборкеОстаток - КСборкеЗаказаноОстаток КАК Количество,
	|	КСборкеОстаток - КСборкеЗаказаноОстаток КАК КоличествоУпаковок,
	|	&ВариантОбеспечения КАК ВариантОбеспечения,
	|	ВЫБОР
	|		КОГДА Номенклатура.ВидНоменклатуры = &НоменклатураВидНоменклатурыТоварПлоттерыСерии 
	|		ТОГДА 14
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусУказанияСерий,
	|	ВЫБОР 
	|		КОГДА Номенклатура = Заявка.Узел ТОГДА
	|			Заявка.НазначениеПолученныйУзел
	|		ИНАЧЕ
	|			Заявка.НазначениеНаЗаменуСнятойЗапаснойЧасти
	|	КОНЕЦ КАК Назначение
	|ИЗ
	|	РегистрНакопления.смартОборудованиеКРазборке.Остатки(
	|		,
	|		Заявка = &Заявка
	|	)
	|ГДЕ
	|	КСборкеОстаток - КСборкеЗаказаноОстаток > 0
	|";
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	Выборка = ПакетРезультатовЗапроса[0].Выбрать();
	
	//3. Заказ на обратную сборку
	
	Если Выборка.Следующий() Тогда
	
		СтруктураЗаполнения = 
			Новый Структура("Организация, Количество, КоличествоУпаковок, Подразделение, ДокументОснование, Дата, Статус, Склад,
							|Номенклатура, Серия, ХозяйственнаяОперация, 
							|НачалоСборкиРазборки, ОкончаниеСборкиРазборки, Товары");
		
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Заявка, "Организация, Подразделение");
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);
		
		СтруктураЗаполнения.Товары = ПакетРезультатовЗапроса[1].Выгрузить();
		
		Документ = Документы.ЗаказНаСборку.СоздатьДокумент();
		Документ.Заполнить(СтруктураЗаполнения);
		Документ.Дата = ТекущаяДатаСеанса() + 30;
		
		Документ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		Документ.СтатусУказанияСерий = 14;
		Документ.ОбосабливатьПоНазначениюЗаказа = Истина;
		
		Для Каждого СтрокаТовары Из Документ.Товары Цикл
			СтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно;	
		КонецЦикла;
		
		Документ.Комментарий = "#Документ создан автоматически#";
		Документ.ДополнительныеСвойства.Вставить("НеОтражатьСостояниеЗаявкиНаРазборОборудования", Истина);
		Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный); 
		
		Возврат;
		
	КонецЕсли;
	//-- #Б2138 смарт: Шляпников 19.02.2025
		
КонецПроцедуры

Функция СформироватьТекстТоварыКЗаказу(Заявка)
	
	Результат = Новый Массив;
	
	Для каждого стрКомплектующая Из Заявка.Комплектующие Цикл
		
		Если стрКомплектующая.НеЗаказывать Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(СтрШаблон("%1 (%2) - %3 %4 (%5)", стрКомплектующая.Номенклатура, 
														  стрКомплектующая.Номенклатура.Артикул,
														  стрКомплектующая.Количество,
														  стрКомплектующая.Номенклатура.ЕдиницаИзмерения,
														  Заявка.НазначениеНаЗаменуСнятойЗапаснойЧасти));
														  
	КонецЦикла;                                        
	
	Возврат СтрСоединить(Результат, Символы.ПС);
	
КонецФункции

Функция ПолучитьАдресФизическогоЛицаДляОтправкиПочтовыхУведомлений(ФизЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АдресЭП КАК АдресЭП
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И Вид.Наименование = ""Email рабочий""";
	
	Запрос.УстановитьПараметр("Ссылка", ФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	
		Если ЗначениеЗаполнено(Выборка.АдресЭП) Тогда
			
			АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.АдресЭП);
			
			Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
				Возврат Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, СокрЛП(ФизЛицо));
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СоздатьРасходныйОрдер(Распоряжение, ДатаОрдера)
	
	ОрдерОбъект = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
	ОрдерОбъект.Дата = ДатаОрдера;
	ОрдерОбъект.ДатаОтгрузки = ДатаОрдера;
	ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
	ОрдерОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
	ОрдерОбъект.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		
		ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещению;
		ОрдерОбъект.Получатель = Распоряжение.СкладПолучатель;
		ОрдерОбъект.Склад = Распоряжение.СкладОтправитель;
		
		Для каждого стрТовары Из Распоряжение.Товары Цикл
		
			НоваяСтрока = ОрдерОбъект.ТоварыПоРаспоряжениям.Добавить();
			НоваяСтрока.Номенклатура = стрТовары.Номенклатура;
			НоваяСтрока.Серия = стрТовары.Серия;
			НоваяСтрока.Назначение = стрТовары.Назначение;
			НоваяСтрока.Количество = стрТовары.Количество;
			НоваяСтрока.Распоряжение = Распоряжение;
			
			Если ЗначениеЗаполнено(стрТовары.Серия) Тогда
				НоваяСтрока.СтатусУказанияСерий = 14;
			КонецЕсли;
			
			НоваяСтрока = ОрдерОбъект.ОтгружаемыеТовары.Добавить();
			НоваяСтрока.Номенклатура = стрТовары.Номенклатура;
			НоваяСтрока.Серия = стрТовары.Серия;
			НоваяСтрока.Назначение = стрТовары.Назначение;
			НоваяСтрока.Количество = стрТовары.Количество;
			НоваяСтрока.КоличествоУпаковок = стрТовары.Количество;
			НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
			
			Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
				НоваяСтрока.СтатусУказанияСерий = 14;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаСборку") И Распоряжение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров Тогда
		
		ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаКомплектовДляРазборки;
		ОрдерОбъект.Получатель = Распоряжение.Склад;
		ОрдерОбъект.Склад = Распоряжение.Склад;
		
		НоваяСтрока = ОрдерОбъект.ТоварыПоРаспоряжениям.Добавить();
		НоваяСтрока.Номенклатура = Распоряжение.Номенклатура;
		НоваяСтрока.Серия = Распоряжение.Серия;
		НоваяСтрока.Назначение = Распоряжение.Назначение;
		НоваяСтрока.Количество = Распоряжение.Количество;
		НоваяСтрока.Распоряжение = Распоряжение;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
			НоваяСтрока.СтатусУказанияСерий = 14;
		КонецЕсли;
		
		НоваяСтрока = ОрдерОбъект.ОтгружаемыеТовары.Добавить();
		НоваяСтрока.Номенклатура = Распоряжение.Номенклатура;
		НоваяСтрока.Серия = Распоряжение.Серия;
		НоваяСтрока.Назначение = Распоряжение.Назначение;
		НоваяСтрока.Количество = Распоряжение.Количество;
		НоваяСтрока.КоличествоУпаковок = Распоряжение.Количество;
		НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
			НоваяСтрока.СтатусУказанияСерий = 14;
		КонецЕсли;
			
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаСборку") И Распоряжение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров Тогда
		
		ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ОтгрузкаКомплектующихДляСборки;
		ОрдерОбъект.Получатель = Распоряжение.Склад;
		ОрдерОбъект.Склад = Распоряжение.Склад;
		
		Для каждого стрТовары Из Распоряжение.Товары Цикл
		
			НоваяСтрока = ОрдерОбъект.ТоварыПоРаспоряжениям.Добавить();
			НоваяСтрока.Номенклатура = стрТовары.Номенклатура;
			НоваяСтрока.Серия = стрТовары.Серия;
			НоваяСтрока.Назначение = стрТовары.Назначение;
			НоваяСтрока.Количество = стрТовары.Количество;
			НоваяСтрока.Распоряжение = Распоряжение;
			
			Если ЗначениеЗаполнено(стрТовары.Серия) Тогда
				НоваяСтрока.СтатусУказанияСерий = 14;
			КонецЕсли;
			
			НоваяСтрока = ОрдерОбъект.ОтгружаемыеТовары.Добавить();
			НоваяСтрока.Номенклатура = стрТовары.Номенклатура;
			НоваяСтрока.Серия = стрТовары.Серия;
			НоваяСтрока.Назначение = стрТовары.Назначение;
			НоваяСтрока.Количество = стрТовары.Количество;
			НоваяСтрока.КоличествоУпаковок = стрТовары.Количество;
			НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
			
			Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
				НоваяСтрока.СтатусУказанияСерий = 14;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОрдерОбъект.Комментарий = "#Документ создан автоматически#";
	ОрдерОбъект.ДополнительныеСвойства.Вставить("НеОтражатьСостояниеЗаявкиНаРазборОборудования", Истина);
	ОрдерОбъект.ДополнительныеСвойства.Вставить("смартПроверятьНаличиеРолиВзятиеРасходногоОрдераВРаботу", Ложь);
	ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	
	Возврат ОрдерОбъект.Ссылка;
	
КонецФункции

Функция СоздатьПриходныйОрдер(Распоряжение, ДатаОрдера)
	
	ОрдерОбъект = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	ОрдерОбъект.Дата = ДатаОрдера;
			
	ОрдерОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
	ОрдерОбъект.Распоряжение = Распоряжение;
	ОрдерОбъект.Ответственный = Пользователи.АвторизованныйПользователь();
	ОрдерОбъект.Комментарий = "Загружен по данным Адмирал";
	ОрдерОбъект.ХозяйственнаяОперация = Распоряжение.ХозяйственнаяОперация;
	ОрдерОбъект.ЗакрыватьГрафикПоступления = Истина;
			
	Если ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		
		ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПоПеремещению;
		ОрдерОбъект.Отправитель = Распоряжение.СкладОтправитель;
		ОрдерОбъект.Склад = Распоряжение.СкладПолучатель;
		
		Для каждого стрТовары Из Распоряжение.Товары Цикл
		
			НоваяСтрока = ОрдерОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура = стрТовары.Номенклатура;
			НоваяСтрока.Серия = стрТовары.Серия;
			НоваяСтрока.Назначение = стрТовары.Назначение;
			НоваяСтрока.Количество = стрТовары.Количество;
			НоваяСтрока.КоличествоУпаковок = стрТовары.Количество;
			
			Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
				НоваяСтрока.СтатусУказанияСерий = 14;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаСборку") И Распоряжение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РазборкаТоваров Тогда
		
		ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаКомплектующихПослеРазборки;
		ОрдерОбъект.Отправитель = Распоряжение.Склад;
		ОрдерОбъект.Склад = Распоряжение.Склад;
		
		Для каждого стрТовары Из Распоряжение.Товары Цикл
		
			НоваяСтрока = ОрдерОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура = стрТовары.Номенклатура;
			НоваяСтрока.Серия = стрТовары.Серия;
			НоваяСтрока.Назначение = стрТовары.Назначение;
			НоваяСтрока.Количество = стрТовары.Количество;
			НоваяСтрока.КоличествоУпаковок = стрТовары.Количество;
			
			Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
				НоваяСтрока.СтатусУказанияСерий = 14;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Распоряжение) = Тип("ДокументСсылка.ЗаказНаСборку") И Распоряжение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров Тогда
		
		ОрдерОбъект.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаСобранныхКомплектов;
		ОрдерОбъект.Отправитель = Распоряжение.Склад;
		ОрдерОбъект.Склад = Распоряжение.Склад;
		
		НоваяСтрока = ОрдерОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Распоряжение.Номенклатура;
		НоваяСтрока.Серия = Распоряжение.Серия;
		НоваяСтрока.Назначение = Распоряжение.Назначение;
		НоваяСтрока.Количество = Распоряжение.Количество;
		НоваяСтрока.КоличествоУпаковок = Распоряжение.Количество;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
			НоваяСтрока.СтатусУказанияСерий = 14;
		КонецЕсли;
		
	КонецЕсли;
	
	ОрдерОбъект.Комментарий = "#Документ создан автоматически#";
	ОрдерОбъект.ДополнительныеСвойства.Вставить("НеОтражатьСостояниеЗаявкиНаРазборОборудования", Истина);
	ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	
	Возврат ОрдерОбъект.Ссылка;
	
КонецФункции

Функция ПроверитьНаличиеОрдера(Распоряжение, ВидОрдера)
	
	Запрос = Новый Запрос;
	
	Если ВидОрдера = 1 Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение
		|	И ПриходныйОрдерНаТовары.Проведен";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
		|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

#КонецЕсли
